# Задача 1.3.
Months = [
    ['Январь', 31], 
    ['Февраль', 28],
    ['Март', 31],
    ['Апрель', 30],
    ['Май', 31],
    ['Июнь', 30],
    ['Июль', 31],
    ['Август', 31],
    ['Сентябрь', 30],
    ['Октябрь', 31],
    ['Ноябрь', 30],
    ['Декабрь', 31]
    ]
search = input('Введите номер месяца: ')
month_number = int(search)
if month_number >= 1 and month_number <= 12:
    print('Вы ввели ', Months[month_number - 1][0], '. ',Months[month_number - 1][1], ' дней')
else:
    print('Такого месяца нет!')